Exercise: Build decision tree model to predict survival based on certain parameters


CSV file is available to download at https://github.com/codebasics/py/blob/master/ML/9_decision_tree/Exercise/titanic.csv

In this file using following columns build a model to predict if person would survive or not,

1) Pclass

2) Sex

3) Age

4) Fare

Calculate score of your model

In [115]:
import pandas as pd

In [116]:
df = pd.read_csv('titanic.csv')

In [117]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [118]:
inputs = df[['Pclass', 'Sex', 'Age', 'Fare']]
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [119]:
target = df['Survived']
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [120]:
#data preprocessing

# from sklearn.preprocessing import LabelEncoder
# le_sex = LabelEncoder()
# inputs['Sex_n'] = le_sex.fit_transform(inputs['Sex'])
# inputs

In [121]:
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})
inputs.head()

C:\Users\ACER\anaconda3\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

In [122]:
#check NaN Valuse 
nan_in_specific_column = inputs['Age'].isna().any()
nan_in_specific_column

True

In [123]:
inputs.dtypes

Pclass      int64
Sex         int64
Age       float64
Fare      float64
dtype: object

In [124]:
inputs.describe()

           Pclass         Sex         Age        Fare
count  891.000000  891.000000  714.000000  891.000000
mean     2.308642    1.352413   29.699118   32.204208
std      0.836071    0.477990   14.526497   49.693429
min      1.000000    1.000000    0.420000    0.000000
25%      2.000000    1.000000   20.125000    7.910400
50%      3.000000    1.000000   28.000000   14.454200
75%      3.000000    2.000000   38.000000   31.000000
max      3.000000    2.000000   80.000000  512.329200

In [125]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

C:\Users\ACER\anaconda3\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [126]:
#check NaN Valuse 
nan_in_specific_column = inputs['Age'].isna().any()
nan_in_specific_column

False

In [127]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [128]:
#train the model
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [129]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

model.score(X_test,y_test)